Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / feb98ac51ae5213d312a84f37077f491a1a51553
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/17519174739

**Plan (last ~500 lines):**
```
                    },
                  - {
                      - Action   = [
                          - "wafv2:GetWebACLForResource",
                          - "wafv2:GetWebACL",
                          - "wafv2:DisassociateWebACL",
                          - "wafv2:AssociateWebACL",
                          - "waf-regional:GetWebACLForResource",
                          - "waf-regional:GetWebACL",
                          - "waf-regional:DisassociateWebACL",
                          - "waf-regional:AssociateWebACL",
                          - "shield:ListProtections",
                          - "shield:GetSubscriptionState",
                          - "shield:DescribeSubscription",
                          - "shield:DescribeProtection",
                          - "shield:DeleteProtection",
                          - "shield:CreateProtection",
                          - "iam:ListServerCertificates",
                          - "iam:GetServerCertificate",
                          - "cognito-idp:DescribeUserPoolClient",
                          - "acm:ListCertificates",
                          - "acm:DescribeCertificate",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:DeleteTags",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:CreateTags",
                          - "ec2:CreateSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:DeregisterTargets",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateLoadBalancer",
                          - "elasticloadbalancing:CreateListener",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:SetWebAcl",
                          - "elasticloadbalancing:SetSubnets",
                          - "elasticloadbalancing:SetSecurityGroups",
                          - "elasticloadbalancing:SetIpAddressType",
                          - "elasticloadbalancing:RemoveListenerCertificates",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyTargetGroup",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:AddListenerCertificates",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "iam:CreateServiceLinkedRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_ebs_csi_controller will be updated in-place
  ~ resource "aws_iam_role" "eks_ebs_csi_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::298367968222:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "ebs-csi-controller-role"
        name                  = "ebs-csi-controller-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_external_dns will be updated in-place
  ~ resource "aws_iam_role" "eks_external_dns" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::298367968222:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-external-dns-role"
        name                  = "eks-external-dns-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_load_balancer_controller will be updated in-place
  ~ resource "aws_iam_role" "eks_load_balancer_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::298367968222:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/7D9AD643A0174E0E1D4DC44F94B42C46"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-load-balancer-controller-role"
        name                  = "eks-load-balancer-controller-role"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.helm.helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "v2.9.3"
              - chart          = "argo-cd"
              - first_deployed = 1757189610
              - last_deployed  = 1757189610
              - name           = "argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file \`server.ingress.enabled\` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the \`configs.params."server.insecure"\` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - configs = {
                          - params = {
                              - "server.insecure" = true
                            }
                        }
                      - global  = {
                          - domain = "argocd.298367968222.realhandsonlabs.net"
                        }
                      - server  = {
                          - ingress = {
                              - annotations      = {
                                  - "external-dns.alpha.kubernetes.io/hostname"      = "argocd.298367968222.realhandsonlabs.net"
                                  - "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
                                  - "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                                }
                              - enabled          = true
                              - extraTls         = [
                                  - {
                                      - hosts = [
                                          - "argocd.298367968222.realhandsonlabs.net",
                                        ]
                                    },
                                ]
                              - ingressClassName = "nginx"
                            }
                        }
                    }
                )
              - version        = "5.51.6"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
      ~ values                     = [
          - <<-EOT
                "configs":
                  "params":
                    "server.insecure": true
                "global":
                  "domain": "argocd.298367968222.realhandsonlabs.net"
                "server":
                  "ingress":
                    "annotations":
                      "external-dns.alpha.kubernetes.io/hostname": "argocd.298367968222.realhandsonlabs.net"
                      "nginx.ingress.kubernetes.io/backend-protocol": "HTTP"
                      "nginx.ingress.kubernetes.io/force-ssl-redirect": "true"
                    "enabled": true
                    "extraTls":
                    - "hosts":
                      - "argocd.298367968222.realhandsonlabs.net"
                    "ingressClassName": "nginx"
            EOT,
        ] -> (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.helm.helm_release.aws_load_balancer_controller will be updated in-place
  ~ resource "helm_release" "aws_load_balancer_controller" {
        id                         = "aws-load-balancer-controller"
      ~ metadata                   = [
          - {
              - app_version    = "v2.13.4"
              - chart          = "aws-load-balancer-controller"
              - first_deployed = 1757187920
              - last_deployed  = 1757189144
              - name           = "aws-load-balancer-controller"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    AWS Load Balancer controller installed!
                EOT
              - revision       = 2
              - values         = jsonencode(
                    {
                      - clusterName    = "cilium"
                      - region         = "us-east-1"
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::298367968222:role/eks-load-balancer-controller-role"
                            }
                          - create      = false
                          - name        = "aws-load-balancer-controller"
                        }
                      - vpcId          = "vpc-0a2ec5d5f7544f642"
                    }
                )
              - version        = "1.13.4"
            },
        ] -> (known after apply)
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "region" -> null
          - value = "us-east-1" -> null
        }
      + set {
          + name  = "enableServiceMutatorWebhook"
          + value = "false"
        }
      + set {
          + name  = "podMutatorWebhookConfig.failurePolicy"
          + value = "Ignore"
        }
      + set {
          + name  = "region"
          + value = (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # module.network.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.network.data.aws_eks_cluster.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "this" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "cilium"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # module.network.data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = "cilium"
      + token = (sensitive value)
    }

  # module.network.helm_release.cilium will be updated in-place
  ~ resource "helm_release" "cilium" {
        id                         = "cilium"
      ~ metadata                   = [
          - {
              - app_version    = "1.17.4"
              - chart          = "cilium"
              - first_deployed = 1757187884
              - last_deployed  = 1757187884
              - name           = "cilium"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    You have successfully installed Cilium with Hubble Relay and Hubble UI.
                    
                    Your release version is 1.17.4.
                    
                    For any further help, visit https://docs.cilium.io/en/v1.17/gettinghelp
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - egressMasqueradeInterfaces = "eth+"
                      - endpointRoutes             = {
                          - enabled = true
                        }
                      - eni                        = {
                          - enabled = true
                        }
                      - hubble                     = {
                          - enabled = true
                          - metrics = {
                              - enableOpenMetrics = true
                              - enabled           = [
                                  - "dns",
                                  - "drop",
                                  - "tcp",
                                  - "flow",
                                  - "port-distribution",
                                  - "icmp",
                                  - "httpV2:exemplars=true;labelsContext=source_ip,source_namespace,source_workload,destination_ip,destination_namespace,destination_workload,traffic_direction",
                                ]
                              - serviceMonitor    = {
                                  - enabled = false
                                }
                            }
                          - relay   = {
                              - enabled = true
                            }
                          - tls     = {
                              - auto = {
                                  - enabled = true
                                  - method  = "helm"
                                }
                            }
                          - ui      = {
                              - enabled = true
                              - ingress = {
                                  - className = "nginx"
                                  - enabled   = true
                                  - hosts     = [
                                      - "hubble.298367968222.realhandsonlabs.net",
                                    ]
                                  - paths     = [
                                      - {
                                          - path     = "/"
                                          - pathType = "Prefix"
                                        },
                                    ]
                                }
                            }
                        }
                      - ipam                       = {
                          - mode = "eni"
                        }
                      - k8sServiceHost             = "7D9AD643A0174E0E1D4DC44F94B42C46.gr7.us-east-1.eks.amazonaws.com"
                      - k8sServicePort             = 443
                      - kubeProxyReplacement       = true
                      - operator                   = {
                          - prometheus = {
                              - enabled        = false
                              - serviceMonitor = {
                                  - enabled = false
                                }
                            }
                        }
                      - prometheus                 = {
                          - enabled        = false
                          - serviceMonitor = {
                              - enabled = false
                            }
                        }
                      - routingMode                = "native"
                    }
                )
              - version        = "1.17.4"
            },
        ] -> (known after apply)
        name                       = "cilium"
        # (27 unchanged attributes hidden)

      - set {
          - name  = "hubble.ui.ingress.hosts[0]" -> null
          - value = "hubble.298367968222.realhandsonlabs.net" -> null
        }
      - set {
          - name  = "k8sServiceHost" -> null
          - value = "7D9AD643A0174E0E1D4DC44F94B42C46.gr7.us-east-1.eks.amazonaws.com" -> null
        }
      + set {
          + name  = "hubble.ui.ingress.hosts[0]"
          + value = (known after apply)
        }
      + set {
          + name  = "k8sServiceHost"
          + value = (known after apply)
        }

        # (29 unchanged blocks hidden)
    }

Plan: 4 to add, 7 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
